<?php
namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
  
    public function run()
    {
        $permissions = [
            
            'الفواتير',
            'قائمة الفواتير',
            'الفواتير المدفوعة',
            'الفواتير المدفوعة جزئيا',
            'الفواتير الغير مدفوعة',
            'ارشيف الفواتير',
            'اضافة فاتورة',
            'حذف الفاتورة',
            'تعديل الفاتورة',
            'ارشفة الفاتورة',
            'طباعةالفاتورة',
            'تغير حالة الدفع',
            'تصدير EXCEL',


            'التقارير',
            'تقرير الفواتير',
            
            'المستخدمين',
            'قائمة المستخدمين',
            'صلاحيات المستخدمين',
            
            'اضافة مرفق',
            'حذف المرفق',
            
            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',
            
            'عرض صلاحية',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',
            
            'المنتجات',
            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',
            
            'الاقسام',
            'اضافة قسم',
            'تعديل قسم',
            'حذف قسم',
            
           
            
        ];
        
        foreach ($permissions as $permission) {
        Permission::create(['name' => $permission]);
        }
    }
}